Revit 2027 API
StructuralSettings.SymbolicCutbackForBeamAndTruss Property
 Symbolic cutback distance to be applied to all beams and trusses.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double SymbolicCutbackForBeamAndTruss { get; set; }
Public Property SymbolicCutbackForBeamAndTruss As Double
	Get
	Set
public:
property double SymbolicCutbackForBeamAndTruss {
	double get ();
	void set (double value);
}
member SymbolicCutbackForBeamAndTruss : float with get, set
Property Value
Double
See Also
Reference
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace